app/Controllers/AutorController.php

    public function listar(){
        $autores = $this->autorModel->findAll();
---
SELECT *
FROM `autor`