app/Controllers/EditoraController.php

    public function listar(){
        return $this->editoraModel->findAll();
---
SELECT *
FROM `editora`