app/Controllers/GeneroController.php

    public function listar(){
        return $this->generoModel->findAll();
---
SELECT *
FROM `genero`