app/Controllers/TipoUsuarioController.php

    public function listar(){
        return $this->tipoUsuarioModel->findAll();
---
SELECT *
FROM `tipo_usuario`